[
  {
    "id": "cell-growth-q1",
    "module": 2,
    "topic": "Cell Growth and Reproduction",
    "text": "A cell maintains a potassium ion (K+) concentration that is 20 times higher inside the cell than outside. Which process is responsible for creating and maintaining this specific gradient?",
    "imageUrl": null,
    "options": [
      {
        "id": "A",
        "text": "Facilitated Diffusion",
        "feedback": "Close! Facilitated diffusion does use a protein, but it moves molecules down a gradient (from high to low) until they are equal. It cannot \"build up\" a 20x higher concentration."
      },
      {
        "id": "B",
        "text": "Osmosis",
        "feedback": "Not quite. Osmosis refers specifically to the movement of water across a membrane, not ions like potassium."
      },
      {
        "id": "C",
        "text": "Active Transport",
        "feedback": "Correct! Whenever a cell creates a concentration difference (moving from Low to High), it must use \"Active Transport\" to \"pump\" those ions against their natural flow."
      },
      {
        "id": "D",
        "text": "Simple Diffusion",
        "feedback": "Incorrect. Simple diffusion only works for small, uncharged molecules (like O₂) moving down a gradient. Ions are charged and cannot pass through the membrane without help."
      }
    ],
    "correctOptionId": "C",
    "inlineTermIds": ["concentration-gradient", "active-transport"],
    "sidebarTermIds": ["active-transport", "concentration-gradient", "protein-pump"],
    "focusHint": "Think about what kind of energy a cell needs when it moves something from where there's less to where there's more.",
    "keyKnowledge": "Moving substances against their concentration gradient (low → high) always requires energy (ATP) via active transport.",
    "commonMisconception": "Students often confuse facilitated diffusion with active transport because both use proteins, but only active transport moves against the gradient.",
    "rationaleQuestion": {
      "text": "Which reason best supports your answer?",
      "options": [
        { "id": "A", "text": "The process moves molecules down their concentration gradient without energy." },
        { "id": "B", "text": "ATP is required to move ions from low to high concentration." },
        { "id": "C", "text": "The plasma membrane allows free passage of all ions." }
      ],
      "correctOptionId": "B",
      "explanation": "Moving ions against their gradient (low to high) requires energy. Only active transport can accomplish this using ATP."
    },
    "misconceptionId": "confuse-facilitated-active",
    "relatedQuestionIds": ["cell-growth-q2", "cell-growth-q4", "cell-growth-q10"]
  },
  {
    "id": "cell-growth-q2",
    "module": 2,
    "topic": "Cell Growth and Reproduction",
    "text": "To produce this steep potassium gradient, the plasma membrane must use a protein pump. What is required for this pump to move ions in this direction?",
    "imageUrl": null,
    "options": [
      {
        "id": "A",
        "text": "The cell must reach equilibrium.",
        "feedback": "Actually, the opposite is true. Equilibrium means the concentration is the same on both sides. This question describes a cell trying to avoid equilibrium to stay alive."
      },
      {
        "id": "B",
        "text": "Thermal energy from the environment.",
        "feedback": "Passive transport relies on the random kinetic energy of molecules, but building a 20x gradient requires a specific biological \"fuel\" produced by the cell."
      },
      {
        "id": "C",
        "text": "Chemical energy in the form of ATP.",
        "feedback": "Correct! Moving ions from a low-concentration environment into a high-concentration cell is like pushing a ball uphill—it requires \"work\" in the form of ATP."
      },
      {
        "id": "D",
        "text": "A concentration gradient that is already equal.",
        "feedback": "If the concentrations were equal, the ions wouldn't \"naturally\" move in one direction. To create the 20x difference, the cell must use energy to force them into the cell."
      }
    ],
    "correctOptionId": "C",
    "inlineTermIds": ["plasma-membrane", "protein-pump", "atp"],
    "sidebarTermIds": ["atp", "active-transport", "concentration-gradient"],
    "focusHint": "Consider what \"fuel\" a cell produces to do work that goes against the natural flow of molecules.",
    "keyKnowledge": "Protein pumps require ATP to move ions against their concentration gradient—this is the energy cost of active transport.",
    "commonMisconception": "Students sometimes think thermal energy drives active transport, but heat only powers passive molecular movement.",
    "rationaleQuestion": {
      "text": "Which reason best supports your answer?",
      "options": [
        { "id": "A", "text": "Equilibrium provides the energy needed for the pump." },
        { "id": "B", "text": "The pump uses ATP because it moves ions against the gradient." },
        { "id": "C", "text": "Heat from the environment powers all cellular pumps." }
      ],
      "correctOptionId": "B",
      "explanation": "Pumping ions against the gradient is like pushing uphill—it requires the cell's own energy currency, ATP."
    },
    "misconceptionId": "confuse-energy-sources",
    "relatedQuestionIds": ["cell-growth-q1", "cell-growth-q10"]
  },
  {
    "id": "cell-growth-q3",
    "module": 2,
    "topic": "Cell Growth and Reproduction",
    "text": "A student is asked to compare the transport of potassium (K+) to the transport of glucose via facilitated diffusion. Which statement correctly identifies a similarity or difference?",
    "imageUrl": null,
    "options": [
      {
        "id": "A",
        "text": "Both processes require the use of ATP.",
        "feedback": "Not quite. While both use proteins, facilitated diffusion is \"passive,\" meaning it happens naturally without the cell spending any ATP."
      },
      {
        "id": "B",
        "text": "Both processes move substances from low concentration to high concentration.",
        "feedback": "Incorrect. Only active transport (the K+ pump) can move substances from Low to High. Facilitated diffusion always moves substances from High to Low."
      },
      {
        "id": "C",
        "text": "Both processes require a membrane protein to help the substance cross.",
        "feedback": "Correct! Because K+ is an ion (charged) and glucose is a large molecule, neither can pass through the lipid bilayer alone; they both need a protein \"doorway.\""
      },
      {
        "id": "D",
        "text": "Neither process requires a membrane protein.",
        "feedback": "Think again! Large or charged particles are blocked by the hydrophobic tails of the plasma membrane. They both require a protein helper."
      }
    ],
    "correctOptionId": "C",
    "inlineTermIds": ["facilitated-diffusion", "active-transport"],
    "sidebarTermIds": ["concentration-gradient", "passive-transport", "plasma-membrane"],
    "focusHint": "Focus on what K+ ions and glucose molecules have in common when crossing a membrane, regardless of energy use.",
    "keyKnowledge": "Both active transport and facilitated diffusion require membrane proteins, but only active transport uses ATP.",
    "commonMisconception": "Students often think that using a protein always means ATP is required. Facilitated diffusion uses proteins but no energy.",
    "rationaleQuestion": {
      "text": "Which reason best supports your answer?",
      "options": [
        { "id": "A", "text": "Both are large/charged and cannot cross the lipid bilayer without protein assistance." },
        { "id": "B", "text": "Both use ATP to cross the membrane." },
        { "id": "C", "text": "Neither substance needs any assistance to cross." }
      ],
      "correctOptionId": "A",
      "explanation": "Charged ions and large molecules cannot pass through the hydrophobic interior of the membrane without transport proteins."
    },
    "misconceptionId": "protein-means-active",
    "relatedQuestionIds": ["cell-growth-q1", "cell-growth-q4"]
  },
  {
    "id": "cell-growth-q4",
    "module": 2,
    "topic": "Cell Growth and Reproduction",
    "text": "Why is the process of moving potassium ions considered \"Active\" while the movement of oxygen (O₂) is considered \"Passive\"?",
    "imageUrl": null,
    "options": [
      {
        "id": "A",
        "text": "Oxygen is a larger molecule than potassium.",
        "feedback": "Actually, O₂ is a very small, nonpolar molecule, which is why it can slip through the membrane easily. Size isn't the reason one is \"active\" and the other is \"passive.\""
      },
      {
        "id": "B",
        "text": "Potassium moves through the lipids, while oxygen moves through a pump.",
        "feedback": "You have it backwards! Oxygen moves directly through the lipid bilayer (passive), while potassium requires a protein pump (active)."
      },
      {
        "id": "C",
        "text": "Potassium is being moved against its gradient, while oxygen moves with its gradient.",
        "feedback": "Correct! \"Active\" implies the cell is working against the natural flow (Low → High). \"Passive\" means the molecule is just flowing naturally (High → Low)."
      },
      {
        "id": "D",
        "text": "Oxygen requires ATP to move, but potassium does not.",
        "feedback": "It's the other way around! Oxygen diffusion is \"free\" for the cell (passive), while pumping potassium costs the cell energy (active)."
      }
    ],
    "correctOptionId": "C",
    "inlineTermIds": ["active-transport", "passive-transport"],
    "sidebarTermIds": ["diffusion", "atp", "concentration-gradient"],
    "focusHint": "Think about whether each substance is moving with or against its concentration gradient.",
    "keyKnowledge": "Active = against the gradient (requires ATP). Passive = with the gradient (no energy needed).",
    "commonMisconception": "Students confuse molecule size with transport type. The key distinction is direction relative to the gradient, not size.",
    "rationaleQuestion": {
      "text": "Which reason best supports your answer?",
      "options": [
        { "id": "A", "text": "Active transport moves against the gradient using energy; passive follows the gradient freely." },
        { "id": "B", "text": "Larger molecules always require active transport." },
        { "id": "C", "text": "Oxygen needs more energy than potassium to move." }
      ],
      "correctOptionId": "A",
      "explanation": "The defining difference is direction: active goes against the gradient (costs energy), passive goes with it (free)."
    },
    "misconceptionId": "size-determines-transport",
    "relatedQuestionIds": ["cell-growth-q1", "cell-growth-q11"]
  },
  {
    "id": "cell-growth-q5",
    "module": 2,
    "topic": "Cell Growth and Reproduction",
    "text": "Which characteristic is shared by all prokaryotes and eukaryotes?",
    "imageUrl": null,
    "options": [
      {
        "id": "A",
        "text": "Ability to store hereditary information",
        "feedback": "Correct! All living cells, from the simplest bacteria to complex human cells, use DNA to store the instructions for life."
      },
      {
        "id": "B",
        "text": "Use of organelles to control cell processes",
        "feedback": "Incorrect. Only eukaryotes have membrane-bound organelles (like a nucleus or mitochondria). Prokaryotes lack these structures."
      },
      {
        "id": "C",
        "text": "Use of cellular respiration for energy release",
        "feedback": "Incorrect. While many organisms use respiration, some prokaryotes rely solely on fermentation or other anaerobic processes."
      },
      {
        "id": "D",
        "text": "Ability to move in response to environmental stimuli",
        "feedback": "Incorrect. While many cells move, some remain stationary throughout their life cycles; therefore, motility is not a universal requirement for all cells."
      }
    ],
    "correctOptionId": "A",
    "inlineTermIds": ["prokaryote", "eukaryote", "dna"],
    "sidebarTermIds": ["dna", "organelle", "nucleus"],
    "focusHint": "Think about what ALL living cells must have in common, regardless of complexity.",
    "keyKnowledge": "All living cells (both prokaryotic and eukaryotic) contain DNA to store hereditary information.",
    "commonMisconception": "Students often think organelles are universal, but membrane-bound organelles are exclusive to eukaryotes.",
    "rationaleQuestion": {
      "text": "Which reason best supports your answer?",
      "options": [
        { "id": "A", "text": "All cells need DNA to pass on instructions to the next generation." },
        { "id": "B", "text": "All cells have a nucleus to store their DNA." },
        { "id": "C", "text": "All cells use the same energy process." }
      ],
      "correctOptionId": "A",
      "explanation": "DNA is the universal molecule of heredity. Even prokaryotes without a nucleus still have DNA."
    },
    "misconceptionId": "organelles-universal",
    "relatedQuestionIds": ["cell-growth-q6"]
  },
  {
    "id": "cell-growth-q6",
    "module": 2,
    "topic": "Cell Growth and Reproduction",
    "text": "Which two structures are common to both prokaryotic and eukaryotic cells?",
    "imageUrl": null,
    "options": [
      {
        "id": "A",
        "text": "Cell wall and nucleus",
        "feedback": "Incorrect. Prokaryotes are defined by their lack of a nucleus."
      },
      {
        "id": "B",
        "text": "Cell wall and chloroplast",
        "feedback": "Incorrect. Chloroplasts are only found in eukaryotic autotrophs (like plants), and not all cells have cell walls."
      },
      {
        "id": "C",
        "text": "Plasma membrane and nucleus",
        "feedback": "Incorrect. You've got half of it right! All cells have a plasma membrane, but only eukaryotes have a nucleus."
      },
      {
        "id": "D",
        "text": "Plasma membrane and cytoplasm",
        "feedback": "Correct! Every living cell requires a plasma membrane to act as a barrier and cytoplasm to serve as the internal \"soup\" where chemical reactions occur."
      }
    ],
    "correctOptionId": "D",
    "inlineTermIds": ["prokaryote", "eukaryote", "plasma-membrane", "nucleus"],
    "sidebarTermIds": ["nucleus", "organelle"],
    "focusHint": "Which structures does even the simplest cell need to survive?",
    "keyKnowledge": "All cells share a plasma membrane (barrier) and cytoplasm (internal environment), but only eukaryotes have a nucleus.",
    "commonMisconception": "Students confuse cell walls with plasma membranes. Not all cells have cell walls, but all cells have plasma membranes.",
    "rationaleQuestion": {
      "text": "Which reason best supports your answer?",
      "options": [
        { "id": "A", "text": "Every cell needs a boundary (membrane) and an interior space (cytoplasm) to function." },
        { "id": "B", "text": "All cells have a nucleus to control their activities." },
        { "id": "C", "text": "Cell walls are present in all living organisms." }
      ],
      "correctOptionId": "A",
      "explanation": "A plasma membrane and cytoplasm are the minimum requirements for any cell to exist and carry out reactions."
    },
    "misconceptionId": "all-cells-have-nucleus",
    "relatedQuestionIds": ["cell-growth-q5"]
  },
  {
    "id": "cell-growth-q7",
    "module": 2,
    "topic": "Cell Growth and Reproduction",
    "text": "Which statement correctly describes how carbon's ability to form four bonds makes it uniquely suited to form macromolecules?",
    "imageUrl": null,
    "options": [
      {
        "id": "A",
        "text": "It forms short, simple carbon chains.",
        "feedback": "Incorrect. Carbon actually excels at forming extremely long and complex chains, which is what allows for large macromolecules."
      },
      {
        "id": "B",
        "text": "It forms large, complex, diverse molecules.",
        "feedback": "Correct! Carbon's \"four-way\" bonding allows it to build the intricate structures (rings, branches, and long chains) necessary for life."
      },
      {
        "id": "C",
        "text": "It forms covalent bonds with other carbon atoms.",
        "feedback": "Partial Truth. While carbon does form covalent bonds with itself, the uniqueness for macromolecules lies in the complexity and diversity those four bonds allow, not just the bond type."
      },
      {
        "id": "D",
        "text": "It forms covalent bonds that can exist in a single plane.",
        "feedback": "Incorrect. Carbon bonds often form 3D tetrahedral shapes, which is vital for the 3D functionality of proteins and DNA."
      }
    ],
    "correctOptionId": "B",
    "inlineTermIds": ["carbon-bonding", "macromolecule"],
    "sidebarTermIds": ["carbon-bonding", "dna"],
    "focusHint": "What does having four bonds allow carbon to build that other elements with fewer bonds cannot?",
    "keyKnowledge": "Carbon's four covalent bonds enable it to form large, complex, and diverse molecules—the foundation of all organic life.",
    "rationaleQuestion": {
      "text": "Which reason best supports your answer?",
      "options": [
        { "id": "A", "text": "Four bonds allow branching, rings, and long chains—creating molecular diversity." },
        { "id": "B", "text": "Carbon only bonds in straight lines." },
        { "id": "C", "text": "Carbon forms ionic bonds with itself." }
      ],
      "correctOptionId": "A",
      "explanation": "Four covalent bonds means carbon can connect in many configurations, enabling the complexity needed for biological molecules."
    },
    "misconceptionId": "carbon-simple-chains",
    "relatedQuestionIds": ["cell-growth-q8", "cell-growth-q13"]
  },
  {
    "id": "cell-growth-q8",
    "module": 2,
    "topic": "Cell Growth and Reproduction",
    "text": "What is the name of the reaction that forms a polymer from monomers by releasing a water molecule?",
    "imageUrl": null,
    "options": [
      {
        "id": "A",
        "text": "Glycolysis",
        "feedback": "Incorrect. Glycolysis is the process of breaking down glucose to produce energy, not building polymers."
      },
      {
        "id": "B",
        "text": "Hydrolysis",
        "feedback": "Incorrect. This is the opposite! Hydrolysis uses water to break polymers apart."
      },
      {
        "id": "C",
        "text": "Photosynthesis",
        "feedback": "Incorrect. Photosynthesis is the process of converting light into chemical energy."
      },
      {
        "id": "D",
        "text": "Dehydration synthesis",
        "feedback": "Correct! \"Dehydration\" means removing water, and \"synthesis\" means putting things together."
      }
    ],
    "correctOptionId": "D",
    "inlineTermIds": ["dehydration-synthesis", "hydrolysis"],
    "sidebarTermIds": ["hydrolysis", "dehydration-synthesis", "macromolecule"],
    "focusHint": "The name of this reaction literally describes what happens: water is removed and something is built.",
    "keyKnowledge": "Dehydration synthesis builds polymers by removing water; hydrolysis breaks them by adding water. They are reverse reactions.",
    "commonMisconception": "Students often confuse hydrolysis and dehydration synthesis because both involve water, but they work in opposite directions.",
    "rationaleQuestion": {
      "text": "Which reason best supports your answer?",
      "options": [
        { "id": "A", "text": "The reaction adds water to break bonds." },
        { "id": "B", "text": "The reaction removes water to form bonds between monomers." },
        { "id": "C", "text": "The reaction converts light energy into chemical energy." }
      ],
      "correctOptionId": "B",
      "explanation": "Dehydration = removing water. Synthesis = building. Monomers join together as a water molecule is released."
    },
    "misconceptionId": "confuse-hydrolysis-dehydration",
    "relatedQuestionIds": ["cell-growth-q7", "cell-growth-q13"]
  },
  {
    "id": "cell-growth-q9",
    "module": 2,
    "topic": "Cell Growth and Reproduction",
    "text": "Which statement best describes the role of an enzyme during a metabolic reaction?",
    "imageUrl": null,
    "options": [
      {
        "id": "A",
        "text": "It adjusts the pH of the reaction medium.",
        "feedback": "Incorrect. Enzymes are actually sensitive to pH; they don't usually change the environment's pH to work."
      },
      {
        "id": "B",
        "text": "It provides energy to carry out the reaction.",
        "feedback": "Incorrect. Enzymes don't provide energy; they lower the \"activation energy\" required to get a reaction started."
      },
      {
        "id": "C",
        "text": "It dissolves substance A in the reaction medium.",
        "feedback": "Incorrect. Enzymes act as biological catalysts, not solvents."
      },
      {
        "id": "D",
        "text": "It speeds up the reaction without being consumed.",
        "feedback": "Correct! Enzymes are catalysts; they accelerate reactions and can be used over and over again because they aren't changed by the reaction."
      }
    ],
    "correctOptionId": "D",
    "inlineTermIds": ["enzyme"],
    "sidebarTermIds": ["enzyme", "atp"],
    "focusHint": "Think about what a catalyst does—and what it does NOT do (like provide energy or get used up).",
    "keyKnowledge": "Enzymes are reusable biological catalysts that lower activation energy to speed up reactions.",
    "commonMisconception": "Students often think enzymes provide energy, but they only lower the barrier (activation energy) for a reaction to occur.",
    "rationaleQuestion": {
      "text": "Which reason best supports your answer?",
      "options": [
        { "id": "A", "text": "Enzymes supply ATP to power the reaction." },
        { "id": "B", "text": "Enzymes lower activation energy and are reusable catalysts." },
        { "id": "C", "text": "Enzymes change the pH to make the reaction happen." }
      ],
      "correctOptionId": "B",
      "explanation": "Enzymes don't provide energy or change conditions—they lower the energy barrier so reactions happen faster, and they can be reused."
    },
    "misconceptionId": "enzymes-provide-energy",
    "relatedQuestionIds": []
  },
  {
    "id": "cell-growth-q10",
    "module": 2,
    "topic": "Cell Growth and Reproduction",
    "text": "A protein moves ions against their concentration gradient. Which molecule is most likely the energy source?",
    "imageUrl": null,
    "options": [
      {
        "id": "A",
        "text": "ATP",
        "feedback": "Correct! Moving things \"uphill\" (against the gradient) requires Active Transport, which is powered by ATP."
      },
      {
        "id": "B",
        "text": "ADP",
        "feedback": "Incorrect. ADP is the \"spent\" version of the energy molecule. It needs another phosphate added to it to become the high-energy ATP."
      },
      {
        "id": "C",
        "text": "Catalase",
        "feedback": "Incorrect. Catalase is an enzyme that breaks down hydrogen peroxide, not an energy source."
      },
      {
        "id": "D",
        "text": "Amylase",
        "feedback": "Incorrect. Amylase is an enzyme in saliva that breaks down starch."
      }
    ],
    "correctOptionId": "A",
    "inlineTermIds": ["concentration-gradient", "atp", "enzyme"],
    "sidebarTermIds": ["active-transport", "protein-pump"],
    "focusHint": "What is the cell's energy currency that powers work against the natural flow?",
    "keyKnowledge": "ATP is the universal energy currency that powers active transport and other energy-requiring cellular processes.",
    "commonMisconception": "Students confuse enzymes (catalase, amylase) with energy molecules. Enzymes speed up reactions but are not energy sources.",
    "rationaleQuestion": {
      "text": "Which reason best supports your answer?",
      "options": [
        { "id": "A", "text": "ADP provides energy for active transport." },
        { "id": "B", "text": "ATP releases energy when it loses a phosphate group, powering the pump." },
        { "id": "C", "text": "Enzymes like catalase power the protein pump." }
      ],
      "correctOptionId": "B",
      "explanation": "ATP → ADP + phosphate releases energy. This energy is what drives protein pumps to move ions against their gradient."
    },
    "misconceptionId": "confuse-enzymes-energy",
    "relatedQuestionIds": ["cell-growth-q1", "cell-growth-q2"]
  },
  {
    "id": "cell-growth-q11",
    "module": 2,
    "topic": "Cell Growth and Reproduction",
    "text": "What determines the direction that carbon dioxide and oxygen move freely across a plasma membrane?",
    "imageUrl": null,
    "options": [
      {
        "id": "A",
        "text": "Orientation of cholesterol in the membrane.",
        "feedback": "Incorrect. Cholesterol helps with membrane fluidity, but it doesn't determine the direction of gas movement."
      },
      {
        "id": "B",
        "text": "Concentration gradient across the plasma membrane.",
        "feedback": "Correct! These gases move via passive diffusion, meaning they naturally travel from where there is a lot of them to where there is less."
      },
      {
        "id": "C",
        "text": "Configuration of phospholipids.",
        "feedback": "Incorrect. Phospholipids form the barrier, but the direction of movement is a matter of physics (concentration)."
      },
      {
        "id": "D",
        "text": "Location of receptors on the surface.",
        "feedback": "Incorrect. Receptors are for cell signaling, not for directing the flow of simple gases like O₂."
      }
    ],
    "correctOptionId": "B",
    "inlineTermIds": ["plasma-membrane", "concentration-gradient", "diffusion"],
    "sidebarTermIds": ["passive-transport", "diffusion"],
    "focusHint": "Small nonpolar gases cross membranes freely. What physical force determines which direction they go?",
    "keyKnowledge": "Small nonpolar molecules (O₂, CO₂) move by simple diffusion, driven solely by the concentration gradient.",
    "rationaleQuestion": {
      "text": "Which reason best supports your answer?",
      "options": [
        { "id": "A", "text": "Gases move from high to low concentration by passive diffusion." },
        { "id": "B", "text": "Membrane receptors direct gas molecules." },
        { "id": "C", "text": "Cholesterol channels guide gases through the membrane." }
      ],
      "correctOptionId": "A",
      "explanation": "O₂ and CO₂ are small and nonpolar, so they freely diffuse across the membrane down their concentration gradient."
    },
    "misconceptionId": "membrane-structure-directs-gases",
    "relatedQuestionIds": ["cell-growth-q4", "cell-growth-q12"]
  },
  {
    "id": "cell-growth-q12",
    "module": 2,
    "topic": "Cell Growth and Reproduction",
    "text": "How does the structure of alveoli (microscopic air sacs) allow lungs to function properly?",
    "imageUrl": null,
    "options": [
      {
        "id": "A",
        "text": "They increase the amount of energy transferred from the lungs to the blood.",
        "feedback": "Incorrect. Alveoli are involved in gas transport, not the direct transfer of metabolic energy (ATP) to the blood."
      },
      {
        "id": "B",
        "text": "They increase the flexibility of the lungs as they expand.",
        "feedback": "Incorrect. While lungs are flexible, the primary \"job\" of the alveoli is the exchange of gases (O₂ and CO₂), not providing structural elasticity."
      },
      {
        "id": "C",
        "text": "They increase the volume of the lungs, allowing more oxygen to be inhaled.",
        "feedback": "Incorrect. Volume refers to the total space; however, the key to efficient breathing is the amount of contact space between air and blood, known as surface area."
      },
      {
        "id": "D",
        "text": "They increase the surface area of the lungs, allowing efficient gas exchange.",
        "feedback": "Correct! By being divided into millions of tiny sacs, the alveoli provide a massive surface area, which allows oxygen to move into the blood much faster."
      }
    ],
    "correctOptionId": "D",
    "inlineTermIds": ["alveoli", "surface-area"],
    "sidebarTermIds": ["surface-area", "diffusion", "homeostasis"],
    "focusHint": "Think about why having millions of tiny sacs is better for gas exchange than one big open space.",
    "keyKnowledge": "Increased surface area (from many small alveoli) maximizes the rate of gas exchange by diffusion.",
    "commonMisconception": "Students confuse volume with surface area. It's not about how much space the lungs hold, but how much contact area exists for gas exchange.",
    "rationaleQuestion": {
      "text": "Which reason best supports your answer?",
      "options": [
        { "id": "A", "text": "More surface area means more space for O₂ and CO₂ to cross into/out of the blood." },
        { "id": "B", "text": "Larger volume means the lungs can hold more oxygen." },
        { "id": "C", "text": "Alveoli produce ATP that is transferred to the blood." }
      ],
      "correctOptionId": "A",
      "explanation": "Millions of tiny alveoli create a huge surface area, maximizing the area where diffusion of gases can occur."
    },
    "misconceptionId": "volume-vs-surface-area",
    "relatedQuestionIds": ["cell-growth-q11"]
  },
  {
    "id": "cell-growth-q13",
    "module": 2,
    "topic": "Cell Growth and Reproduction",
    "text": "How do the structures of proteins generally differ from the structures of carbohydrates?",
    "imageUrl": null,
    "options": [
      {
        "id": "A",
        "text": "Proteins are made of amino acids, while carbohydrates are made of monosaccharides.",
        "feedback": "Correct! This is the fundamental building block difference: proteins are polymers of amino acids, whereas carbohydrates are made of simple sugars like glucose."
      },
      {
        "id": "B",
        "text": "Proteins are always circular, while carbohydrates are always linear.",
        "feedback": "Incorrect. Both can take various shapes; carbohydrates often form rings, and proteins fold into complex 3D globular shapes."
      },
      {
        "id": "C",
        "text": "Proteins contain only carbon and hydrogen, while carbohydrates contain nitrogen.",
        "feedback": "Incorrect. It is actually the opposite—proteins always contain Nitrogen, while simple carbohydrates typically only contain Carbon, Hydrogen, and Oxygen."
      },
      {
        "id": "D",
        "text": "Proteins are smaller and simpler than carbohydrate molecules.",
        "feedback": "Incorrect. Proteins are often much larger and more structurally complex than most carbohydrates due to their intricate folding patterns."
      }
    ],
    "correctOptionId": "A",
    "inlineTermIds": ["amino-acid", "monosaccharide", "macromolecule"],
    "sidebarTermIds": ["amino-acid", "monosaccharide", "dehydration-synthesis"],
    "focusHint": "What are the specific building blocks (monomers) that make up each type of macromolecule?",
    "keyKnowledge": "Proteins are built from amino acids; carbohydrates are built from monosaccharides (simple sugars). Different monomers = different macromolecules.",
    "rationaleQuestion": {
      "text": "Which reason best supports your answer?",
      "options": [
        { "id": "A", "text": "Both macromolecules use the same monomers." },
        { "id": "B", "text": "They differ in their monomers: amino acids vs. monosaccharides." },
        { "id": "C", "text": "Proteins lack nitrogen while carbohydrates contain it." }
      ],
      "correctOptionId": "B",
      "explanation": "The fundamental structural difference is their monomers: amino acids (proteins) vs. monosaccharides (carbohydrates)."
    },
    "misconceptionId": "monomer-confusion",
    "relatedQuestionIds": ["cell-growth-q7", "cell-growth-q8"]
  },
  {
    "id": "cell-growth-q14",
    "module": 2,
    "topic": "Cell Growth and Reproduction",
    "text": "What is one way the rough endoplasmic reticulum (RER) assists the Golgi apparatus?",
    "imageUrl": null,
    "options": [
      {
        "id": "A",
        "text": "It assembles nucleic acids from monomers.",
        "feedback": "Incorrect. Nucleic acids (DNA/RNA) are handled in the nucleus and cytoplasm, not by the RER."
      },
      {
        "id": "B",
        "text": "It breaks down old damaged macromolecules.",
        "feedback": "Incorrect. That is the job of the lysosome, the \"trash disposal\" of the cell."
      },
      {
        "id": "C",
        "text": "It packages new protein molecules into vesicles.",
        "feedback": "Correct! The RER synthesizes proteins and then pinches them off into little bubbles called vesicles to be sent to the Golgi for final shipping."
      },
      {
        "id": "D",
        "text": "It determines which protein molecules to synthesize.",
        "feedback": "Incorrect. The \"instructions\" for which proteins to make come from the DNA in the nucleus, not the RER itself."
      }
    ],
    "correctOptionId": "C",
    "inlineTermIds": ["rough-er", "golgi-apparatus", "macromolecule"],
    "sidebarTermIds": ["rough-er", "golgi-apparatus", "organelle", "nucleus"],
    "focusHint": "Think about the production line: one organelle makes the product, another processes and ships it. What connects them?",
    "keyKnowledge": "The RER makes proteins and sends them in vesicles to the Golgi apparatus, which modifies and ships them to their destination.",
    "rationaleQuestion": {
      "text": "Which reason best supports your answer?",
      "options": [
        { "id": "A", "text": "The RER produces proteins and packages them in vesicles for the Golgi." },
        { "id": "B", "text": "The RER reads DNA to decide which proteins to make." },
        { "id": "C", "text": "The RER breaks down waste for the Golgi to recycle." }
      ],
      "correctOptionId": "A",
      "explanation": "RER → vesicles → Golgi is the protein production and delivery pipeline of the cell."
    },
    "misconceptionId": "organelle-roles-confused",
    "relatedQuestionIds": []
  },
  {
    "id": "cell-growth-q15",
    "module": 2,
    "topic": "Cell Growth and Reproduction",
    "text": "Which example is an activity that a fish most likely uses to maintain homeostasis?",
    "imageUrl": null,
    "options": [
      {
        "id": "A",
        "text": "Using camouflage to avoid predators.",
        "feedback": "Incorrect. This is an adaptation for survival and protection, but it doesn't regulate the fish's internal chemical balance."
      },
      {
        "id": "B",
        "text": "Feeding at night to regulate body temperature.",
        "feedback": "Incorrect. Feeding provides energy, but for most fish, internal temperature is regulated by the environment (water), not their feeding schedule."
      },
      {
        "id": "C",
        "text": "Moving to deeper water to regulate metabolic wastes.",
        "feedback": "Incorrect. While moving can help find different environments, waste regulation is typically handled by organs like the kidneys and gills."
      },
      {
        "id": "D",
        "text": "Exchanging gases through its gills to regulate oxygen levels.",
        "feedback": "Correct! Homeostasis is about keeping internal levels steady. By exchanging gases, the fish keeps its internal oxygen at the right level for survival."
      }
    ],
    "correctOptionId": "D",
    "inlineTermIds": ["homeostasis", "diffusion"],
    "sidebarTermIds": ["homeostasis", "diffusion", "plasma-membrane"],
    "focusHint": "Homeostasis means maintaining stable internal conditions. Which activity directly regulates an internal level?",
    "keyKnowledge": "Homeostasis is the regulation of internal conditions (like O₂ levels). Gas exchange through gills directly maintains internal balance.",
    "rationaleQuestion": {
      "text": "Which reason best supports your answer?",
      "options": [
        { "id": "A", "text": "Camouflage regulates internal oxygen levels." },
        { "id": "B", "text": "Gas exchange through gills directly maintains internal O₂ and CO₂ balance." },
        { "id": "C", "text": "Moving to deeper water controls internal temperature." }
      ],
      "correctOptionId": "B",
      "explanation": "Gills perform gas exchange, directly regulating internal O₂ and CO₂ levels—a classic example of homeostasis."
    },
    "misconceptionId": "adaptation-vs-homeostasis",
    "relatedQuestionIds": []
  }
]
